
# all the messages that i use in program are here

welcome_message = """!برنامه رسم توابع ریاضی

در این برنامه، شما می‌توانید انواع مختلف توابع ریاضی را با وارد کردن پارامترهای آن‌ها رسم کنید

یک تابع، رابطه ای بین مجموعه های اعداد است که به هر عضو از یک مجموعه یک عضو منحصر به فرد از مجموعه دیگر

 نسبت می‌دهد به عبارت دیگر یک تابع فرمول ریاضی است که یک مقدار ورودی را به یک مقدار خروجی نگاشت می‌کند

توابع می‌توانند انواع مختلفی داشته باشندکه هر یک دارای فرمول و ویژگی‌های خاص خود هستند

در این برنامه، شما می‌توانید پارامترهای یک تابع خاص را وارد کنید و برنامه نمودار آن تابع را برای شما رسم 

خواهد کرد این به شما کمک می‌کند تا بهتر درک کنید که چگونه تغییر پارامترها بر شکل نمودار تابع تأثیر می‌گذارد




 لطفاً نوع تابع مورد نظر خود را از لیست انتخاب کنید و پارامترهای آن را وارد نمایید
 
 سپس برنامه نمودار آن تابع را برای شما رسم خواهد کرد
"""

linear_message = """ که دامنه و برد آن زیر مجموعه از y = ax + b تابع خطی تابعی است به فرم
اعداد حقیقی است. نمودار این تابع به شکل یک خط راست در صفحه است

لطفا مقادیر خواسته شده را وارد کنید"""

constant_message = """عددی حقیقی است c که y = c تابع ثابت تابعی است با ضابطه ی
و برد آن شامل یک عضو میباشد و نمودار آن خطی موازی محور طول ها است

لطفا مقادیر خواسته شده را وارد کنید"""

identity_message = """در این تابع دامنه و برد برابر می باشد y = x تابع همانی تابعی است به فرم
 و هر عضو از دامنه دقیقا  به همان عضو در برد نظیر میشود
 
 در این تابع ورودی دریافت نمیشود و نمودار آن نیمساز ربع اول و سوم جدول است"""

parabola_message = """می باشد و شکل آن y = ax^2 + bx + c سهمی یا تابع درجه 2 تابعی است به فرم
 در صفحه به صورت یک منحنی است
  
لطفا مقادیر خواسته شده را وارد کنید"""

absolute_value_message = """که هر مقدار در y = |x + a| + b تابع قدر مطلق تابعی است به فرم
دامنه را به قدر مطلق آن در برد نظیر می کند

لطفا مقادیر خواسته شده را وارد کنید"""

